In [23]:
import numpy as np
import pandas as pd
from pandas import Series
from pandas import DataFrame

### 1.Series使用

============================================

#### 练习1：

使用多种方法创建以下Series，命名为s1：  
语文 150   
数学 150   
英语 150   
理综 300   

============================================

In [2]:
# 列表的方式创建
l = [150] * 3 + [300]
s1 = Series(l)
s1.index = ['语文', '数学', '英语', '理综']
s1

语文    150
数学    150
英语    150
理综    300
dtype: int64

In [3]:
# 字典的方式
s1 = Series({'语文': 150, '数学': 150, '英语': 150, '理综': 300})
s1

数学    150
理综    300
英语    150
语文    150
dtype: int64

In [4]:
# 关键字的方法
data = [150] * 3 + [300]
index =  ['语文', '数学', '英语', '理综']
s = Series(data=data , index=index)
s

语文    150
数学    150
英语    150
理综    300
dtype: int64

============================================

#### 练习2：

使用多种方法对练习1创建的Series s1进行索引和切片：

索引：
数学 150 

切片：
语文 150 
数学 150 
英语 150 

============================================

In [7]:
# 显式索引
display(s)
s['数学']

语文    150
数学    150
英语    150
理综    300
dtype: int64

150

In [8]:
s.loc['数学']

150

In [9]:
# 隐式索引
s.iloc[1]

150

In [10]:
# 切片
s['语文': '英语']

语文    150
数学    150
英语    150
dtype: int64

In [11]:
s.loc['语文': '英语']

语文    150
数学    150
英语    150
dtype: int64

In [12]:
# 隐式
s.iloc[0:3]

语文    150
数学    150
英语    150
dtype: int64

### 练习3
去除Series中的NaN值

In [13]:
s = Series(data=[1,2,3,4,np.nan], index=list('abcde'))
s

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [14]:
s[s.notnull()]

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [16]:
Series.name = 'Range'   # Series对象本身及其实例都有一个name属性
s

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
Name: Range, dtype: float64

============================================

#### 练习3：

1. 想一想Series运算和ndarray运算的规则有什么不同？

2. 新建另一个索引包含“文综”的Series s2，并与s1进行多种算术操作。思考如何保存所有数据。

============================================

1, Series 没有广播机制
2, Series索引不对应会补NaN,如果不想补NaN,则可以用pandas提供的方法比如add,sub

In [18]:
data = [150] * 3 + [300]
index =  ['语文', '数学', '英语', '理综']
s1 = Series(data=data , index=index)
s1

语文    150
数学    150
英语    150
理综    300
dtype: int64

In [19]:
s2 = Series(data=[300], index=['文综'])
s2

文综    300
dtype: int64

In [20]:
s1.add(s2, fill_value=0)  # 添加add()函数fill_value会防止NaN的出现
    ## 一般直接打印出来的不会改变原对象

数学    150.0
文综    300.0
理综    300.0
英语    150.0
语文    150.0
dtype: float64

In [22]:
s1 + s2  # 显示很多NaN

数学   NaN
文综   NaN
理综   NaN
英语   NaN
语文   NaN
dtype: float64

## 2.DataFrame

============================================

#### 练习4：

根据以下考试成绩表，创建一个DataFrame，命名为df：
```
    张三  李四
语文 150  0
数学 150  0
英语 150  0
理综 300  0
```

============================================

In [24]:
# 常用方法创建DataFrame
columns = ['张三', '李四']
index = ['语文', '数学', '英语', '理综']
data = [[150,0],[150,0],[150,0],[300,0]]
df = DataFrame(data=data,index=index, columns=columns)
df

     张三  李四
语文  150   0
数学  150   0
英语  150   0
理综  300   0

In [25]:
# 字典方法创建
df = DataFrame({'张三': [150]*3 + [300], '李四': [0]*4}, index=['语文', '数学', '英语', '理综'])
df

     张三  李四
语文  150   0
数学  150   0
英语  150   0
理综  300   0

### DataFrame索引

In [ ]:
记住: 永远写 行索引的时候,使用.loc[], 使用列索引的时候,直接用中括号.

============================================

#### 练习5：

使用多种方法对df进行索引和切片，并比较其中的区别

============================================

In [27]:
data = np.random.randint(150, size=(4,5))
index = ['张三', '李四', '王五', '赵六']
columns = ['语文', '数学', '英语', 'python','理宗']
df = DataFrame(data=data, index=index, columns=columns)
df

     语文   数学   英语  python   理宗
张三  100   87   30     122  144
李四   68  105  141      53   33
王五   83  118   58     114   68
赵六   57  106   99      52  108

1, 找李四的python成绩
2, 找王五的理综成绩
3, 切片: 张三和李四
4, 列切片: python成绩和理综成绩

In [29]:
# 1.列索引
df['python']['李四']

53

In [30]:
# 行索引
df.loc['李四']['python']

53

In [31]:
# 隐式索引
df.iloc[1,3]

53

In [32]:
# 2.
df.iloc[2,4]

68

In [33]:
# 3.行切片
df.loc['张三': '李四']

     语文   数学   英语  python   理宗
张三  100   87   30     122  144
李四   68  105  141      53   33

In [34]:
# 隐式索引的时候,是左闭右开的区间.
df.iloc[0:2]

     语文   数学   英语  python   理宗
张三  100   87   30     122  144
李四   68  105  141      53   33

In [35]:
# 4.列切片
df.iloc[:, 3:]

    python   理宗
张三     122  144
李四      53   33
王五     114   68
赵六      52  108

In [37]:
df[['python','理宗']]

    python   理宗
张三     122  144
李四      53   33
王五     114   68
赵六      52  108

相同的索引进行了相加,不同索引补NaN
相同的索引指的是,行和列索引都必须相同才可以.

In [39]:
data = np.random.randint(0,150, size=(4,5))
index=['张三', '李四', '王二麻子', '钱七']
columns = ['Chinses', 'Math', '英语', 'python', '理宗']
df2 = DataFrame(data=data, index=index, columns=columns)
df2

      Chinses  Math   英语  python   理宗
张三         72    70  125     129  136
李四         80    93   80      80   67
王二麻子        3    89  103      39  135
钱七          8    21   27      86  113

In [40]:
# 使用pandas的运算函数,可以保留原始数据
df.add(df2, fill_value=0)

      Chinses  Math  python     数学     理宗     英语     语文
张三       72.0  70.0   251.0   87.0  280.0  155.0  100.0
李四       80.0  93.0   133.0  105.0  100.0  221.0   68.0
王二麻子      3.0  89.0    39.0    NaN  135.0  103.0    NaN
王五        NaN   NaN   114.0  118.0   68.0   58.0   83.0
赵六        NaN   NaN    52.0  106.0  108.0   99.0   57.0
钱七        8.0  21.0    86.0    NaN  113.0   27.0    NaN

##  3.Series与DataFrame之间的运算

【重要】

- 使用Python操作符：以行为单位操作（参数必须是行），对所有行都有效。（类似于numpy中二维数组与一维数组的运算，但可能出现NaN）

- 使用pandas操作函数：

        axis=0：以列为单位操作（参数必须是列），对所有列都有效。
        axis=1：以行为单位操作（参数必须是行），对所有行都有效。。

In [ ]:
#### 以下是以加法为例（学会活用pandas操作函数的对应表）

In [41]:
data=np.random.randint(0,150,size=(4,4))
index=['张三', '李四', '王五', '赵六']
colums=['语文', '数学', '英语', 'python']
df1 = DataFrame(data=data, index=index, columns=colums)
df1

     语文   数学   英语  python
张三   71   53   92     136
李四   68    4  122      11
王五  127   91  106     144
赵六  107  132  139       5

In [42]:
s = Series(data=np.random.randint(20, size=5), index=['语文', '数学', '英语', 'python', '理综'])
s

语文        17
数学         4
英语        13
python    11
理综        10
dtype: int64

In [ ]:
# 1.以列为单位操作时，dataframe和series相加的时候,fill_value无效(默认的操作是对列进行操作).

In [43]:
df1+s  # df1.add(s)

    python   数学  理综   英语   语文
张三     147   57 NaN  105   88
李四      22    8 NaN  135   85
王五     155   95 NaN  119  144
赵六      16  136 NaN  152  124

In [ ]:
# 2.以行为单位操作时，需要在函数内部写行的 axis='index'

In [45]:
s2 = Series(data=np.random.randint(20, size=4), index=['张三', '李四', '王五', '赵六'])
s2

张三     8
李四    17
王五    12
赵六     3
dtype: int64

In [47]:
df1.add(s2, axis='index')

     语文   数学   英语  python
张三   79   61  100     144
李四   85   21  139      28
王五  139  103  118     156
赵六  110  135  142       8

============================================

#### 练习6：

1. 假设ddd是期中考试成绩，ddd2是期末考试成绩，请自由创建ddd2，并将其与ddd相加，求期中期末平均值。

2. 假设张三期中考试数学被发现作弊，要记为0分，如何实现？

3. 李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？

4. 后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？

============================================